{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv\/Relu:0",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "name" : "resfcn256\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "Placeholder__0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock\/shortcut\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock\/shortcut\/Conv2D:0",
      "blob_weights" : 5,
      "K" : 16,
      "stride_x" : 2,
      "name" : "resfcn256\/resBlock\/shortcut\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "resfcn256\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock\/Conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock\/Conv\/Relu:0",
      "blob_weights" : 9,
      "K" : 16,
      "blob_biases" : 7,
      "name" : "resfcn256\/resBlock\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "resfcn256\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock\/Conv_1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock\/Conv_1\/Relu:0",
      "blob_weights" : 13,
      "K" : 16,
      "blob_biases" : 11,
      "stride_x" : 2,
      "name" : "resfcn256\/resBlock\/Conv_1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "resfcn256\/resBlock\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock\/Conv_2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock\/Conv_2\/Conv2D:0",
      "blob_weights" : 15,
      "K" : 16,
      "name" : "resfcn256\/resBlock\/Conv_2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "resfcn256\/resBlock\/Conv_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "resfcn256\/resBlock\/Conv_2\/Conv2D:0,resfcn256\/resBlock\/shortcut\/Conv2D:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "resfcn256\/resBlock\/add:0",
      "top" : "resfcn256\/resBlock\/add:0",
      "type" : "elementwise",
      "name" : "resfcn256\/resBlock\/add:0",
      "beta" : 0
    },
    {
      "name" : "resfcn256\/resBlock\/BatchNorm\/FusedBatchNorm:0",
      "bottom" : "resfcn256\/resBlock\/add:0",
      "weights" : {

      },
      "debug_info" : "resfcn256\/resBlock\/BatchNorm\/FusedBatchNorm:0",
      "top" : "resfcn256\/resBlock\/BatchNorm\/FusedBatchNorm:0",
      "C" : 32,
      "blob_batchnorm_params" : 17,
      "type" : "batchnorm"
    },
    {
      "bottom" : "resfcn256\/resBlock\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "resfcn256\/resBlock\/Relu:0",
      "top" : "resfcn256\/resBlock\/Relu:0",
      "type" : "activation",
      "name" : "resfcn256\/resBlock\/Relu:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_1\/Conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_1\/Conv\/Relu:0",
      "blob_weights" : 21,
      "K" : 32,
      "blob_biases" : 19,
      "name" : "resfcn256\/resBlock_1\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "resfcn256\/resBlock\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_1\/Conv_1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_1\/Conv_1\/Relu:0",
      "blob_weights" : 25,
      "K" : 16,
      "blob_biases" : 23,
      "name" : "resfcn256\/resBlock_1\/Conv_1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "resfcn256\/resBlock_1\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_1\/Conv_2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_1\/Conv_2\/Conv2D:0",
      "blob_weights" : 27,
      "K" : 16,
      "name" : "resfcn256\/resBlock_1\/Conv_2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "resfcn256\/resBlock_1\/Conv_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "resfcn256\/resBlock_1\/Conv_2\/Conv2D:0,resfcn256\/resBlock\/Relu:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "resfcn256\/resBlock_1\/add:0",
      "top" : "resfcn256\/resBlock_1\/add:0",
      "type" : "elementwise",
      "name" : "resfcn256\/resBlock_1\/add:0",
      "beta" : 0
    },
    {
      "name" : "resfcn256\/resBlock_1\/BatchNorm\/FusedBatchNorm:0",
      "bottom" : "resfcn256\/resBlock_1\/add:0",
      "weights" : {

      },
      "debug_info" : "resfcn256\/resBlock_1\/BatchNorm\/FusedBatchNorm:0",
      "top" : "resfcn256\/resBlock_1\/BatchNorm\/FusedBatchNorm:0",
      "C" : 32,
      "blob_batchnorm_params" : 29,
      "type" : "batchnorm"
    },
    {
      "bottom" : "resfcn256\/resBlock_1\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "resfcn256\/resBlock_1\/Relu:0",
      "top" : "resfcn256\/resBlock_1\/Relu:0",
      "type" : "activation",
      "name" : "resfcn256\/resBlock_1\/Relu:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_2\/shortcut\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_2\/shortcut\/Conv2D:0",
      "blob_weights" : 31,
      "K" : 32,
      "stride_x" : 2,
      "name" : "resfcn256\/resBlock_2\/shortcut\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "resfcn256\/resBlock_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_2\/Conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_2\/Conv\/Relu:0",
      "blob_weights" : 35,
      "K" : 32,
      "blob_biases" : 33,
      "name" : "resfcn256\/resBlock_2\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "resfcn256\/resBlock_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_2\/Conv_1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_2\/Conv_1\/Relu:0",
      "blob_weights" : 39,
      "K" : 32,
      "blob_biases" : 37,
      "stride_x" : 2,
      "name" : "resfcn256\/resBlock_2\/Conv_1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "resfcn256\/resBlock_2\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_2\/Conv_2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_2\/Conv_2\/Conv2D:0",
      "blob_weights" : 41,
      "K" : 32,
      "name" : "resfcn256\/resBlock_2\/Conv_2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "resfcn256\/resBlock_2\/Conv_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "resfcn256\/resBlock_2\/Conv_2\/Conv2D:0,resfcn256\/resBlock_2\/shortcut\/Conv2D:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "resfcn256\/resBlock_2\/add:0",
      "top" : "resfcn256\/resBlock_2\/add:0",
      "type" : "elementwise",
      "name" : "resfcn256\/resBlock_2\/add:0",
      "beta" : 0
    },
    {
      "name" : "resfcn256\/resBlock_2\/BatchNorm\/FusedBatchNorm:0",
      "bottom" : "resfcn256\/resBlock_2\/add:0",
      "weights" : {

      },
      "debug_info" : "resfcn256\/resBlock_2\/BatchNorm\/FusedBatchNorm:0",
      "top" : "resfcn256\/resBlock_2\/BatchNorm\/FusedBatchNorm:0",
      "C" : 64,
      "blob_batchnorm_params" : 43,
      "type" : "batchnorm"
    },
    {
      "bottom" : "resfcn256\/resBlock_2\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "resfcn256\/resBlock_2\/Relu:0",
      "top" : "resfcn256\/resBlock_2\/Relu:0",
      "type" : "activation",
      "name" : "resfcn256\/resBlock_2\/Relu:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_3\/Conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_3\/Conv\/Relu:0",
      "blob_weights" : 47,
      "K" : 64,
      "blob_biases" : 45,
      "name" : "resfcn256\/resBlock_3\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "resfcn256\/resBlock_2\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_3\/Conv_1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_3\/Conv_1\/Relu:0",
      "blob_weights" : 51,
      "K" : 32,
      "blob_biases" : 49,
      "name" : "resfcn256\/resBlock_3\/Conv_1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "resfcn256\/resBlock_3\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_3\/Conv_2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_3\/Conv_2\/Conv2D:0",
      "blob_weights" : 53,
      "K" : 32,
      "name" : "resfcn256\/resBlock_3\/Conv_2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "resfcn256\/resBlock_3\/Conv_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "resfcn256\/resBlock_3\/Conv_2\/Conv2D:0,resfcn256\/resBlock_2\/Relu:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "resfcn256\/resBlock_3\/add:0",
      "top" : "resfcn256\/resBlock_3\/add:0",
      "type" : "elementwise",
      "name" : "resfcn256\/resBlock_3\/add:0",
      "beta" : 0
    },
    {
      "name" : "resfcn256\/resBlock_3\/BatchNorm\/FusedBatchNorm:0",
      "bottom" : "resfcn256\/resBlock_3\/add:0",
      "weights" : {

      },
      "debug_info" : "resfcn256\/resBlock_3\/BatchNorm\/FusedBatchNorm:0",
      "top" : "resfcn256\/resBlock_3\/BatchNorm\/FusedBatchNorm:0",
      "C" : 64,
      "blob_batchnorm_params" : 55,
      "type" : "batchnorm"
    },
    {
      "bottom" : "resfcn256\/resBlock_3\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "resfcn256\/resBlock_3\/Relu:0",
      "top" : "resfcn256\/resBlock_3\/Relu:0",
      "type" : "activation",
      "name" : "resfcn256\/resBlock_3\/Relu:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_4\/shortcut\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_4\/shortcut\/Conv2D:0",
      "blob_weights" : 57,
      "K" : 64,
      "stride_x" : 2,
      "name" : "resfcn256\/resBlock_4\/shortcut\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "resfcn256\/resBlock_3\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_4\/Conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_4\/Conv\/Relu:0",
      "blob_weights" : 61,
      "K" : 64,
      "blob_biases" : 59,
      "name" : "resfcn256\/resBlock_4\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "resfcn256\/resBlock_3\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_4\/Conv_1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_4\/Conv_1\/Relu:0",
      "blob_weights" : 65,
      "K" : 64,
      "blob_biases" : 63,
      "stride_x" : 2,
      "name" : "resfcn256\/resBlock_4\/Conv_1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "resfcn256\/resBlock_4\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_4\/Conv_2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_4\/Conv_2\/Conv2D:0",
      "blob_weights" : 67,
      "K" : 64,
      "name" : "resfcn256\/resBlock_4\/Conv_2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "resfcn256\/resBlock_4\/Conv_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "resfcn256\/resBlock_4\/Conv_2\/Conv2D:0,resfcn256\/resBlock_4\/shortcut\/Conv2D:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "resfcn256\/resBlock_4\/add:0",
      "top" : "resfcn256\/resBlock_4\/add:0",
      "type" : "elementwise",
      "name" : "resfcn256\/resBlock_4\/add:0",
      "beta" : 0
    },
    {
      "name" : "resfcn256\/resBlock_4\/BatchNorm\/FusedBatchNorm:0",
      "bottom" : "resfcn256\/resBlock_4\/add:0",
      "weights" : {

      },
      "debug_info" : "resfcn256\/resBlock_4\/BatchNorm\/FusedBatchNorm:0",
      "top" : "resfcn256\/resBlock_4\/BatchNorm\/FusedBatchNorm:0",
      "C" : 128,
      "blob_batchnorm_params" : 69,
      "type" : "batchnorm"
    },
    {
      "bottom" : "resfcn256\/resBlock_4\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "resfcn256\/resBlock_4\/Relu:0",
      "top" : "resfcn256\/resBlock_4\/Relu:0",
      "type" : "activation",
      "name" : "resfcn256\/resBlock_4\/Relu:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_5\/Conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_5\/Conv\/Relu:0",
      "blob_weights" : 73,
      "K" : 128,
      "blob_biases" : 71,
      "name" : "resfcn256\/resBlock_5\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "resfcn256\/resBlock_4\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_5\/Conv_1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_5\/Conv_1\/Relu:0",
      "blob_weights" : 77,
      "K" : 64,
      "blob_biases" : 75,
      "name" : "resfcn256\/resBlock_5\/Conv_1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "resfcn256\/resBlock_5\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_5\/Conv_2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_5\/Conv_2\/Conv2D:0",
      "blob_weights" : 79,
      "K" : 64,
      "name" : "resfcn256\/resBlock_5\/Conv_2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "resfcn256\/resBlock_5\/Conv_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "resfcn256\/resBlock_5\/Conv_2\/Conv2D:0,resfcn256\/resBlock_4\/Relu:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "resfcn256\/resBlock_5\/add:0",
      "top" : "resfcn256\/resBlock_5\/add:0",
      "type" : "elementwise",
      "name" : "resfcn256\/resBlock_5\/add:0",
      "beta" : 0
    },
    {
      "name" : "resfcn256\/resBlock_5\/BatchNorm\/FusedBatchNorm:0",
      "bottom" : "resfcn256\/resBlock_5\/add:0",
      "weights" : {

      },
      "debug_info" : "resfcn256\/resBlock_5\/BatchNorm\/FusedBatchNorm:0",
      "top" : "resfcn256\/resBlock_5\/BatchNorm\/FusedBatchNorm:0",
      "C" : 128,
      "blob_batchnorm_params" : 81,
      "type" : "batchnorm"
    },
    {
      "bottom" : "resfcn256\/resBlock_5\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "resfcn256\/resBlock_5\/Relu:0",
      "top" : "resfcn256\/resBlock_5\/Relu:0",
      "type" : "activation",
      "name" : "resfcn256\/resBlock_5\/Relu:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_6\/shortcut\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_6\/shortcut\/Conv2D:0",
      "blob_weights" : 83,
      "K" : 128,
      "stride_x" : 2,
      "name" : "resfcn256\/resBlock_6\/shortcut\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "resfcn256\/resBlock_5\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_6\/Conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_6\/Conv\/Relu:0",
      "blob_weights" : 87,
      "K" : 128,
      "blob_biases" : 85,
      "name" : "resfcn256\/resBlock_6\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "resfcn256\/resBlock_5\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_6\/Conv_1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_6\/Conv_1\/Relu:0",
      "blob_weights" : 91,
      "K" : 128,
      "blob_biases" : 89,
      "stride_x" : 2,
      "name" : "resfcn256\/resBlock_6\/Conv_1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "resfcn256\/resBlock_6\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_6\/Conv_2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_6\/Conv_2\/Conv2D:0",
      "blob_weights" : 93,
      "K" : 128,
      "name" : "resfcn256\/resBlock_6\/Conv_2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "resfcn256\/resBlock_6\/Conv_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "resfcn256\/resBlock_6\/Conv_2\/Conv2D:0,resfcn256\/resBlock_6\/shortcut\/Conv2D:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "resfcn256\/resBlock_6\/add:0",
      "top" : "resfcn256\/resBlock_6\/add:0",
      "type" : "elementwise",
      "name" : "resfcn256\/resBlock_6\/add:0",
      "beta" : 0
    },
    {
      "name" : "resfcn256\/resBlock_6\/BatchNorm\/FusedBatchNorm:0",
      "bottom" : "resfcn256\/resBlock_6\/add:0",
      "weights" : {

      },
      "debug_info" : "resfcn256\/resBlock_6\/BatchNorm\/FusedBatchNorm:0",
      "top" : "resfcn256\/resBlock_6\/BatchNorm\/FusedBatchNorm:0",
      "C" : 256,
      "blob_batchnorm_params" : 95,
      "type" : "batchnorm"
    },
    {
      "bottom" : "resfcn256\/resBlock_6\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "resfcn256\/resBlock_6\/Relu:0",
      "top" : "resfcn256\/resBlock_6\/Relu:0",
      "type" : "activation",
      "name" : "resfcn256\/resBlock_6\/Relu:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_7\/Conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_7\/Conv\/Relu:0",
      "blob_weights" : 99,
      "K" : 256,
      "blob_biases" : 97,
      "name" : "resfcn256\/resBlock_7\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "resfcn256\/resBlock_6\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_7\/Conv_1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_7\/Conv_1\/Relu:0",
      "blob_weights" : 103,
      "K" : 128,
      "blob_biases" : 101,
      "name" : "resfcn256\/resBlock_7\/Conv_1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "resfcn256\/resBlock_7\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_7\/Conv_2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_7\/Conv_2\/Conv2D:0",
      "blob_weights" : 105,
      "K" : 128,
      "name" : "resfcn256\/resBlock_7\/Conv_2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "resfcn256\/resBlock_7\/Conv_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "resfcn256\/resBlock_7\/Conv_2\/Conv2D:0,resfcn256\/resBlock_6\/Relu:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "resfcn256\/resBlock_7\/add:0",
      "top" : "resfcn256\/resBlock_7\/add:0",
      "type" : "elementwise",
      "name" : "resfcn256\/resBlock_7\/add:0",
      "beta" : 0
    },
    {
      "name" : "resfcn256\/resBlock_7\/BatchNorm\/FusedBatchNorm:0",
      "bottom" : "resfcn256\/resBlock_7\/add:0",
      "weights" : {

      },
      "debug_info" : "resfcn256\/resBlock_7\/BatchNorm\/FusedBatchNorm:0",
      "top" : "resfcn256\/resBlock_7\/BatchNorm\/FusedBatchNorm:0",
      "C" : 256,
      "blob_batchnorm_params" : 107,
      "type" : "batchnorm"
    },
    {
      "bottom" : "resfcn256\/resBlock_7\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "resfcn256\/resBlock_7\/Relu:0",
      "top" : "resfcn256\/resBlock_7\/Relu:0",
      "type" : "activation",
      "name" : "resfcn256\/resBlock_7\/Relu:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_8\/shortcut\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_8\/shortcut\/Conv2D:0",
      "blob_weights" : 109,
      "K" : 256,
      "stride_x" : 2,
      "name" : "resfcn256\/resBlock_8\/shortcut\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 512,
      "bottom" : "resfcn256\/resBlock_7\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_8\/Conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_8\/Conv\/Relu:0",
      "blob_weights" : 113,
      "K" : 256,
      "blob_biases" : 111,
      "name" : "resfcn256\/resBlock_8\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "resfcn256\/resBlock_7\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_8\/Conv_1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_8\/Conv_1\/Relu:0",
      "blob_weights" : 117,
      "K" : 256,
      "blob_biases" : 115,
      "stride_x" : 2,
      "name" : "resfcn256\/resBlock_8\/Conv_1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "resfcn256\/resBlock_8\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_8\/Conv_2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_8\/Conv_2\/Conv2D:0",
      "blob_weights" : 119,
      "K" : 256,
      "name" : "resfcn256\/resBlock_8\/Conv_2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 512,
      "bottom" : "resfcn256\/resBlock_8\/Conv_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "resfcn256\/resBlock_8\/Conv_2\/Conv2D:0,resfcn256\/resBlock_8\/shortcut\/Conv2D:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "resfcn256\/resBlock_8\/add:0",
      "top" : "resfcn256\/resBlock_8\/add:0",
      "type" : "elementwise",
      "name" : "resfcn256\/resBlock_8\/add:0",
      "beta" : 0
    },
    {
      "name" : "resfcn256\/resBlock_8\/BatchNorm\/FusedBatchNorm:0",
      "bottom" : "resfcn256\/resBlock_8\/add:0",
      "weights" : {

      },
      "debug_info" : "resfcn256\/resBlock_8\/BatchNorm\/FusedBatchNorm:0",
      "top" : "resfcn256\/resBlock_8\/BatchNorm\/FusedBatchNorm:0",
      "C" : 512,
      "blob_batchnorm_params" : 121,
      "type" : "batchnorm"
    },
    {
      "bottom" : "resfcn256\/resBlock_8\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "resfcn256\/resBlock_8\/Relu:0",
      "top" : "resfcn256\/resBlock_8\/Relu:0",
      "type" : "activation",
      "name" : "resfcn256\/resBlock_8\/Relu:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_9\/Conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_9\/Conv\/Relu:0",
      "blob_weights" : 125,
      "K" : 512,
      "blob_biases" : 123,
      "name" : "resfcn256\/resBlock_9\/Conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "resfcn256\/resBlock_8\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_9\/Conv_1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_9\/Conv_1\/Relu:0",
      "blob_weights" : 129,
      "K" : 256,
      "blob_biases" : 127,
      "name" : "resfcn256\/resBlock_9\/Conv_1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "resfcn256\/resBlock_9\/Conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/resBlock_9\/Conv_2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/resBlock_9\/Conv_2\/Conv2D:0",
      "blob_weights" : 131,
      "K" : 256,
      "name" : "resfcn256\/resBlock_9\/Conv_2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 512,
      "bottom" : "resfcn256\/resBlock_9\/Conv_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "resfcn256\/resBlock_9\/Conv_2\/Conv2D:0,resfcn256\/resBlock_8\/Relu:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "resfcn256\/resBlock_9\/add:0",
      "top" : "resfcn256\/resBlock_9\/add:0",
      "type" : "elementwise",
      "name" : "resfcn256\/resBlock_9\/add:0",
      "beta" : 0
    },
    {
      "name" : "resfcn256\/resBlock_9\/BatchNorm\/FusedBatchNorm:0",
      "bottom" : "resfcn256\/resBlock_9\/add:0",
      "weights" : {

      },
      "debug_info" : "resfcn256\/resBlock_9\/BatchNorm\/FusedBatchNorm:0",
      "top" : "resfcn256\/resBlock_9\/BatchNorm\/FusedBatchNorm:0",
      "C" : 512,
      "blob_batchnorm_params" : 133,
      "type" : "batchnorm"
    },
    {
      "bottom" : "resfcn256\/resBlock_9\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "resfcn256\/resBlock_9\/Relu:0",
      "top" : "resfcn256\/resBlock_9\/Relu:0",
      "type" : "activation",
      "name" : "resfcn256\/resBlock_9\/Relu:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose\/Relu:0",
      "blob_weights" : 137,
      "K" : 512,
      "blob_biases" : 135,
      "name" : "resfcn256\/Conv2d_transpose\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "resfcn256\/resBlock_9\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_1\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_1\/Relu:0",
      "blob_weights" : 141,
      "K" : 512,
      "blob_biases" : 139,
      "stride_x" : 2,
      "name" : "resfcn256\/Conv2d_transpose_1\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "resfcn256\/Conv2d_transpose\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_2\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_2\/Relu:0",
      "blob_weights" : 145,
      "K" : 256,
      "blob_biases" : 143,
      "name" : "resfcn256\/Conv2d_transpose_2\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "resfcn256\/Conv2d_transpose_1\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_3\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_3\/Relu:0",
      "blob_weights" : 149,
      "K" : 256,
      "blob_biases" : 147,
      "name" : "resfcn256\/Conv2d_transpose_3\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "resfcn256\/Conv2d_transpose_2\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_4\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_4\/Relu:0",
      "blob_weights" : 153,
      "K" : 256,
      "blob_biases" : 151,
      "stride_x" : 2,
      "name" : "resfcn256\/Conv2d_transpose_4\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "resfcn256\/Conv2d_transpose_3\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_5\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_5\/Relu:0",
      "blob_weights" : 157,
      "K" : 128,
      "blob_biases" : 155,
      "name" : "resfcn256\/Conv2d_transpose_5\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "resfcn256\/Conv2d_transpose_4\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_6\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_6\/Relu:0",
      "blob_weights" : 161,
      "K" : 128,
      "blob_biases" : 159,
      "name" : "resfcn256\/Conv2d_transpose_6\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "resfcn256\/Conv2d_transpose_5\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_7\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_7\/Relu:0",
      "blob_weights" : 165,
      "K" : 128,
      "blob_biases" : 163,
      "stride_x" : 2,
      "name" : "resfcn256\/Conv2d_transpose_7\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "resfcn256\/Conv2d_transpose_6\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_8\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_8\/Relu:0",
      "blob_weights" : 169,
      "K" : 64,
      "blob_biases" : 167,
      "name" : "resfcn256\/Conv2d_transpose_8\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "resfcn256\/Conv2d_transpose_7\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_9\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_9\/Relu:0",
      "blob_weights" : 173,
      "K" : 64,
      "blob_biases" : 171,
      "name" : "resfcn256\/Conv2d_transpose_9\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "resfcn256\/Conv2d_transpose_8\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_10\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_10\/Relu:0",
      "blob_weights" : 177,
      "K" : 64,
      "blob_biases" : 175,
      "stride_x" : 2,
      "name" : "resfcn256\/Conv2d_transpose_10\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "resfcn256\/Conv2d_transpose_9\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_11\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_11\/Relu:0",
      "blob_weights" : 181,
      "K" : 32,
      "blob_biases" : 179,
      "name" : "resfcn256\/Conv2d_transpose_11\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "resfcn256\/Conv2d_transpose_10\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_12\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_12\/Relu:0",
      "blob_weights" : 185,
      "K" : 32,
      "blob_biases" : 183,
      "stride_x" : 2,
      "name" : "resfcn256\/Conv2d_transpose_12\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "resfcn256\/Conv2d_transpose_11\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_13\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_13\/Relu:0",
      "blob_weights" : 189,
      "K" : 16,
      "blob_biases" : 187,
      "name" : "resfcn256\/Conv2d_transpose_13\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "resfcn256\/Conv2d_transpose_12\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_14\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_14\/Relu:0",
      "blob_weights" : 193,
      "K" : 16,
      "blob_biases" : 191,
      "name" : "resfcn256\/Conv2d_transpose_14\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 3,
      "bottom" : "resfcn256\/Conv2d_transpose_13\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_15\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_15\/Relu:0",
      "blob_weights" : 197,
      "K" : 3,
      "blob_biases" : 195,
      "name" : "resfcn256\/Conv2d_transpose_15\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 3,
      "bottom" : "resfcn256\/Conv2d_transpose_14\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "resfcn256\/Conv2d_transpose_16\/conv2d_transpose:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "resfcn256\/Conv2d_transpose_16\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 201,
      "K" : 3,
      "blob_biases" : 199,
      "name" : "resfcn256\/Conv2d_transpose_16\/conv2d_transpose:0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 3,
      "bottom" : "resfcn256\/Conv2d_transpose_15\/Relu:0",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "bottom" : "resfcn256\/Conv2d_transpose_16\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "resfcn256\/Conv2d_transpose_16\/Sigmoid:0",
      "top" : "resfcn256__Conv2d_transpose_16__Sigmoid__0",
      "type" : "activation",
      "name" : "resfcn256\/Conv2d_transpose_16\/Sigmoid:0",
      "attributes" : {
